In [25]:
import pandas as pd
from sqlalchemy import create_engine

In [26]:
# Importando Dados
tabela_clientes = pd.read_csv("1-datasets/Clientes.csv", sep=";")
tabela_pedidos = pd.read_csv("1-datasets/Pedidos.csv", sep=";")
tabela_produtos = pd.read_csv("1-datasets/Produtos.csv", sep=";")
tabela_vendas = pd.read_csv("1-datasets/Vendas.csv", sep=";")

Clientes

In [27]:
# Exibindo a tabela
tabela_clientes.head()

,ID Cliente,Nome Cliente,Segmento,Cidade,Estado,Pais,Mercado,Regiao
0,RH-19495,Rick Hansen,Consumidor,New York City,New York,United States,US,East
1,JR-16210,Justin Ritter,Corporativo,Wollongong,New South Wales,Australia,APAC,Oceania
2,CR-12730,Craig Reiter,Consumidor,Brisbane,Queensland,Australia,APAC,Oceania
3,KM-16375,Katherine Murray,Outros,Berlin,Berlin,Germany,EU,Central
4,RH-9495,Rick Hansen,Consumidor,Dakar,Dakar,Senegal,Africa,Africa

In [28]:
# Verficando valores nulos
tabela_clientes.isna().sum()

ID Cliente      0
Nome Cliente    0
Segmento        0
Cidade          0
Estado          0
Pais            0
Mercado         0
Regiao          0
dtype: int64

In [29]:
# Verificando duplicatas
total_duplicatas = tabela_clientes.duplicated().sum()
print(f'Total de linhas duplicadas: {total_duplicatas}')

Total de linhas duplicadas: 0

In [30]:
# Alterando o nome das colunas
tabela_clientes.columns = ['id_cliente', 'nome', 'segmento', 'cidade', 'estado', 'pais', 'mercado', 'regiao']
tabela_clientes.head()

,id_cliente,nome,segmento,cidade,estado,pais,mercado,regiao
0,RH-19495,Rick Hansen,Consumidor,New York City,New York,United States,US,East
1,JR-16210,Justin Ritter,Corporativo,Wollongong,New South Wales,Australia,APAC,Oceania
2,CR-12730,Craig Reiter,Consumidor,Brisbane,Queensland,Australia,APAC,Oceania
3,KM-16375,Katherine Murray,Outros,Berlin,Berlin,Germany,EU,Central
4,RH-9495,Rick Hansen,Consumidor,Dakar,Dakar,Senegal,Africa,Africa

Pedidos

In [31]:
# Exibindo a tabela
tabela_pedidos.head()

         ID Pedido Data Pedido  Data Envio       Modo Envio Prioridade Pedido
0   CA-2012-124891  31-07-2012  31-07-2012        Mesmo Dia           Critico
1   CA-2012-124891  31-07-2012  31-07-2012        Mesmo Dia           Critico
2    IN-2013-77878  05-02-2013  07-02-2013   Segunda Classe           Critico
3    IN-2013-71249  17-10-2013  18-10-2013  Primeira Classe             Medio
4  ES-2013-1579342  28-01-2013  30-01-2013  Primeira Classe             Medio

In [32]:
# Verficando valores nulos
tabela_pedidos.isna().sum()

ID Pedido            0
Data Pedido          0
Data Envio           0
Modo Envio           0
Prioridade Pedido    0
dtype: int64

In [33]:

total_duplicatas = tabela_pedidos.duplicated().sum()
print(f'Total de linhas duplicadas: {total_duplicatas}')

Total de linhas duplicadas: 1

In [34]:
# removendo linhas duplicadas
tabela_pedidos.drop_duplicates(inplace=True)

In [35]:
# Verificando novamente se as linhas foram removidas
print(tabela_pedidos.duplicated().sum())

0

In [36]:
# Alterando o nome das colunas
tabela_pedidos.columns = ['id_pedido', 'data_pedido', 'data_envio', 'modo_envio', 'prioridade']
tabela_pedidos.head()

         id_pedido data_pedido  data_envio       modo_envio prioridade
0   CA-2012-124891  31-07-2012  31-07-2012        Mesmo Dia    Critico
2    IN-2013-77878  05-02-2013  07-02-2013   Segunda Classe    Critico
3    IN-2013-71249  17-10-2013  18-10-2013  Primeira Classe      Medio
4  ES-2013-1579342  28-01-2013  30-01-2013  Primeira Classe      Medio
5     SG-2013-4320  05-11-2013  06-11-2013        Mesmo Dia    Critico

Produtos

In [37]:
# Exibindo a tabela
tabela_produtos.head()

,ID Produto,Categoria,SubCategoria,Nome Produto
0,TEC-AC-10003033,Tecnologia,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...
1,TEC-AC-10003033,Tecnologia,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...
2,FUR-CH-10003950,Moveis,Chairs,"Novimex Executive Leather Armchair, Black"
3,TEC-PH-10004664,Tecnologia,Phones,"Nokia Smart Phone, with Caller ID"
4,TEC-PH-10004583,Tecnologia,Phones,"Motorola Smart Phone, Cordless"

In [38]:
# Verficando valores nulos
tabela_produtos.isna().sum()

ID Produto      0
Categoria       0
SubCategoria    0
Nome Produto    0
dtype: int64

In [39]:
# Verificando duplicatas
total_duplicatas = tabela_produtos.duplicated().sum()
print(f'Total de linhas duplicadas: {total_duplicatas}')

Total de linhas duplicadas: 1

In [40]:
# Removendo linhas duplicadas
tabela_produtos.drop_duplicates(inplace=True)

In [41]:
# Verificando novamente se as linhas foram removidas
print(tabela_produtos.duplicated().sum())

0

In [42]:
# Alterando o nome das colunas
tabela_produtos.columns = ['id_produto', 'categoria', 'subcategoria', 'nome_produto']
tabela_produtos.head()

,id_produto,categoria,subcategoria,nome_produto
0,TEC-AC-10003033,Tecnologia,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...
2,FUR-CH-10003950,Moveis,Chairs,"Novimex Executive Leather Armchair, Black"
3,TEC-PH-10004664,Tecnologia,Phones,"Nokia Smart Phone, with Caller ID"
4,TEC-PH-10004583,Tecnologia,Phones,"Motorola Smart Phone, Cordless"
5,TEC-SHA-10000501,Tecnologia,Copiers,"Sharp Wireless Fax, High-Speed"

Vendas

In [43]:
# Exibindo a tabela
tabela_vendas.head()

,Pedido,Cliente,Produto,Valor Venda,Quantidade Vendida,Custo Envio
0,CA-2012-124891,RH-19495,TEC-AC-10003033,"2309,65",7,"933,57"
1,IN-2013-77878,JR-16210,FUR-CH-10003950,"3709,395",9,"923,63"
2,IN-2013-71249,CR-12730,TEC-PH-10004664,"5175,171",9,"915,49"
3,ES-2013-1579342,KM-16375,TEC-PH-10004583,"2892,51",5,"910,16"
4,SG-2013-4320,RH-9495,TEC-SHA-10000501,"2832,96",8,"903,04"

In [44]:
# Verificando valores nulos
tabela_vendas.isna().sum()

Pedido                0
Cliente               0
Produto               0
Valor Venda           0
Quantidade Vendida    0
Custo Envio           0
dtype: int64

In [45]:
# Verificando duplicatas
total_duplicatas = tabela_vendas.duplicated().sum()
print(f'Total de linhas duplicadas: {total_duplicatas}')

Total de linhas duplicadas: 0

In [46]:
# Alterando o nome das colunas
tabela_vendas.columns = ['id_pedido', 'id_cliente', 'id_produto', 'valor_venda', 'quantidade_vendida', 'custo_envio']
tabela_vendas.head()

,id_pedido,id_cliente,id_produto,valor_venda,quantidade_vendida,custo_envio
0,CA-2012-124891,RH-19495,TEC-AC-10003033,"2309,65",7,"933,57"
1,IN-2013-77878,JR-16210,FUR-CH-10003950,"3709,395",9,"923,63"
2,IN-2013-71249,CR-12730,TEC-PH-10004664,"5175,171",9,"915,49"
3,ES-2013-1579342,KM-16375,TEC-PH-10004583,"2892,51",5,"910,16"
4,SG-2013-4320,RH-9495,TEC-SHA-10000501,"2832,96",8,"903,04"

### Conectando o MySQL

In [ ]:
# Criando a conexão com MySQL
# Padrão para inserir o caminho: mysql+mysqlconnector://usuario:senha@host/nome_do_banco
engine = create_engine('mysql+mysqlconnector://root:*******/empresa')

In [48]:
# Enviando os dados
tabela_vendas.to_sql('vendas', con=engine, if_exists='replace', index=False)
tabela_pedidos.to_sql('pedidos', con=engine, if_exists='replace', index=False)
tabela_produtos.to_sql('produtos', con=engine, if_exists='replace', index=False)
tabela_clientes.to_sql('clientes', con=engine, if_exists='replace', index=False)

print(f"Sucesso! {len(tabela_clientes)} linhas inseridas no MySQL mantendo a estrutura original.")
print(f"Sucesso! {len(tabela_pedidos)} linhas inseridas no MySQL mantendo a estrutura original.")
print(f"Sucesso! {len(tabela_produtos)} linhas inseridas no MySQL mantendo a estrutura original.")
print(f"Sucesso! {len(tabela_vendas)} linhas inseridas no MySQL mantendo a estrutura original.")

Sucesso! 1590 linhas inseridas no MySQL mantendo a estrutura original.
Sucesso! 25035 linhas inseridas no MySQL mantendo a estrutura original.
Sucesso! 10292 linhas inseridas no MySQL mantendo a estrutura original.
Sucesso! 51290 linhas inseridas no MySQL mantendo a estrutura original.